{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 128, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 10, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}], "backend": "tensorflow"}